#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Азат
#
# Created:     08.12.2018
# Copyright:   (c) Азат 2018
# Licence:     <your licence>
#-------------------------------------------------------------------------------



x = float(input('in X():'))
y = float(input('in Y():'))

#-------------------------------------------------------------------------------
#Spera
A = 2
B = -1
R = 2
Elips = (x-A)*(x-A)+(y-B)*(y-B) <= pow(R,2)

#-------------------------------------------------------------------------------
#Pryamougolnik_1
xP1 =  1
yP1 = -1

xP2 =  4
yP2 = -3

Pryamou1 = (x>=xP1 and y>=yP2 and x<=xP2 and y<=yP1 )
#-------------------------------------------------------------------------------
#Pryamougolnik_2
xP1_ = 2
yP1_ = -2.5

xP2_ = 6
yP2_ = -5

Pryamou2 = (x>=xP1_ and y>=yP2_ and x<=xP2_ and y<=yP1_ )
#-------------------------------------------------------------------------------
#Pryamougolnik_3
xP1_0 =  1
yP1_0 = -3

xP2_0 =  4
yP2_0 = -5

Pryamou3 = (x>=xP1_0 and y>=yP2_0 and x<=xP2_0 and y<=yP1_0 )
#-------------------------------------------------------------------------------

if ( Elips and Pryamou1 and Pryamou2) or (Pryamou3 and not Pryamou2) or (Elips and Pryamou1):
    print('Входит.')
else:
    print('Не входит.')








